src/cf/InformationRegisters/ЖурналСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСобытий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияПрохода</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГосНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Подключение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Подключение</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>21</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВиртуальныйХост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючМаршрутизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ExchangeServer/Ext/Module.bsl
#Область ПрограммныйИнтерфейс 

Процедура ExportData() Экспорт   
	
	ТекстСообщения = СформироватьНаСервереТекст();
	Если ТекстСообщения = "[]" Тогда
		Возврат;	
	КонецЕсли;
	СтрПодключение = Справочники.Подключение.НайтиПоКоду("000000001"); //просто для примера
	
	Структура = Новый Структура;
	Структура.Вставить("Адрес",             СтрПодключение.Адрес);
	Структура.Вставить("Порт",              СтрПодключение.Порт);
	Структура.Вставить("Логин",             СтрПодключение.Логин);
	Структура.Вставить("Пароль",            СтрПодключение.Пароль);
	Структура.Вставить("ВиртуальныйХост",   СтрПодключение.ВиртуальныйХост);
	Структура.Вставить("ТочкаОбмена",       СтрПодключение.ТочкаОбмена);
	Структура.Вставить("ИмяОчереди",        СтрПодключение.ИмяОчереди); 
	Структура.Вставить("ТекстСообщения",    ТекстСообщения);
	Структура.Вставить("КлючМаршрутизации", СтрПодключение.КлючМаршрутизации);
	
	КлиентКомпоненты = rabbitClientServer.ПолучитьКомпонентуСервер();
	rabbitClientServer.ОтправитьСообщениеКлиентСервер(КлиентКомпоненты,Структура);
	
КонецПроцедуры

Процедура ImportData() Экспорт
	
	СтрПодключение = Справочники.Подключение.НайтиПоКоду("000000001"); //просто для примера
	
	Структура = Новый Структура;
	Структура.Вставить("Адрес",             СтрПодключение.Адрес);
	Структура.Вставить("Порт",              СтрПодключение.Порт);
	Структура.Вставить("Логин",             СтрПодключение.Логин);
	Структура.Вставить("Пароль",            СтрПодключение.Пароль);
	Структура.Вставить("ВиртуальныйХост",   СтрПодключение.ВиртуальныйХост);
	Структура.Вставить("ТочкаОбмена",       СтрПодключение.ТочкаОбмена);
	Структура.Вставить("ИмяОчереди",        СтрПодключение.ИмяОчереди); 
	
	
	КлиентКомпоненты = rabbitClientServer.ПолучитьКомпонентуСервер();
	ОтветноеСообщение = rabbitClientServer.ПрочитатьСообщениеКлиентСервер(КлиентКомпоненты,Структура);   
	
	РегистрыСведений.ЖурналСобытий.ЗаписатьСобытиеВЖурнал(ОтветноеСообщение);
	
КонецПроцедуры

Функция СформироватьНаСервере()Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЖурналСобытий.Период КАК time,
	|	ЖурналСобытий.ОбъектДоступа КАК object,
	|	ЖурналСобытий.ТочкаДоступа КАК point,
	|	ЖурналСобытий.Направление КАК direction,
	|	ЖурналСобытий.ГосНомера КАК number,
	|	ЖурналСобытий.ОбъектДоступа.Должность КАК job,
	|	ЖурналСобытий.ОбъектДоступа.Отдел КАК department,
	|	ЖурналСобытий.ОбъектДоступа.ТабельныйНомер КАК objtabnum
	|ИЗ
	|	РегистрСведений.ЖурналСобытий КАК ЖурналСобытий";
	
	Массив = Новый Массив;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл	
		
		Структура = Новый Структура;
		Структура.Вставить("time",       Строка(Выборка.time)); 
		Структура.Вставить("date",       Строка(ТекущаяДатаСеанса()));
		Структура.Вставить("object",     Строка(Выборка.object));
		Структура.Вставить("point",      Строка(Выборка.point)); 
		Структура.Вставить("direction",  Строка(Выборка.direction));
		Структура.Вставить("number",     Строка(Выборка.number));
		Структура.Вставить("job",        Строка(Выборка.job)); 
		Структура.Вставить("department", Строка(Выборка.department)); 
		Структура.Вставить("objtabnum",  Строка(Выборка.objtabnum)); 
		
		Массив.Добавить(Структура); 
		
	КонецЦикла;
	
	
	Возврат БОНД_Коннектор.ОбъектВJson(Массив); 
	
КонецФункции 

Функция СформироватьНаСервереТекст()Экспорт 
	
	
	Строка =   //31.12.2024 
	"[
	|{
	|""time"": ""01.01.0001 8:27:47"",
	|""date"": ""31.12.2024 8:33:57"",
	|""object"": ""Засульский Денис Викторович"",
	|""point"": ""МКЦ Турникет 3"",
	|""direction"": ""Вход"",
	|""number"": """",
	|""job"": ""Программист 1С"",
	|""department"": ""Отдел программирования ООО \""А1\"""",
	|""objtabnum"": ""66565"", 
	|""objphonenumber"":""79002371457""
	|},
	|{
	|""time"": ""01.01.0001 17:00:00"",
	|""date"": ""31.12.2024 8:33:57"",
	|""object"": ""Засульский Денис Викторович"",
	|""point"": ""МКЦ Турникет 3"",
	|""direction"": ""Выход"",
	|""number"": """",
	|""job"": ""Программист 1С"",
	|""department"": ""Отдел программирования ООО \""А1\"""",
	|""objtabnum"": ""66565"", 
	|""objphonenumber"":""79002371457""
	|},
	|{
	|""time"": ""01.01.0001 8:00:00"",
	|""date"": ""31.12.2024 8:33:57"",
	|""object"": ""Никитин Алексей  Александрович"",
	|""point"": ""МКЦ Турникет 3"",
	|""direction"": ""Вход"",
	|""number"": """",
	|""job"": ""Ведущий программист 1С"",
	|""department"": ""Отдел программирования ООО \""А1\"""",
	|""objtabnum"": ""1212121"", 
	|""objphonenumber"":""79002371457""
	|},
	|{
	|""time"": ""01.01.0001 17:00:00"",
	|""date"": ""31.12.2024 8:33:57"",
	|""object"": ""Никитин Алексей  Александрович"",
	|""point"": ""МКЦ Турникет 3"",
	|""direction"": ""Выход"",
	|""number"": """",
	|""job"": ""Ведущий программист 1С"",
	|""department"": ""Отдел программирования ООО \""А1\"""",
	|""objtabnum"": ""1212121"", 
	|""objphonenumber"":""79002371457""
	|},
	|{
	|""time"": ""01.01.0001 8:27:47"",
	|""date"": ""31.12.2024 8:33:57"",
	|""object"": ""Окдиров Ресул"",
	|""point"": ""МКЦ Турникет 3"",
	|""direction"": ""Вход"",
	|""number"": """",
	|""job"": ""Программист 1С"",
	|""department"": ""Отдел программирования ООО \""А1\"""",
	|""objtabnum"": ""97876"", 
	|""objphonenumber"":""79002371457""
	|},
	|{
	|""time"": ""01.01.0001 17:00:00"",
	|""date"": ""31.12.2024 8:33:57"",
	|""object"": ""Окдиров Ресул"",
	|""point"": ""МКЦ Турникет 3"",
	|""direction"": ""Выход"",
	|""number"": """",
	|""job"": ""Программист 1С"",
	|""department"": ""Отдел программирования ООО \""А1\"""",
	|""objtabnum"": ""97876"", 
	|""objphonenumber"":""79002371457""
	|}]"; 
	
	ДатаЗаменить = Строка(ТекущаяДатаСеанса());
	Строка = СтрЗаменить(Строка,"31.12.2024 8:33:57",	ДатаЗаменить);
	
	Возврат Строка; 
	
КонецФункции  

#КонецОбласти
